In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

In [2]:
data=pd.read_excel("C:/Users/pooja sinalkar/Downloads/Social_Network_Ads.xlsx")

In [3]:
data.head()

      User ID  Gender   Age  EstimatedSalary  Purchased
0  15624510.0    Male  19.0          19000.0        0.0
1  15810944.0    Male  35.0          20000.0        0.0
2  15668575.0  Female  26.0          43000.0        0.0
3  15603246.0  Female  27.0          57000.0        0.0
4  15804002.0    Male  19.0          76000.0        0.0

In [4]:
data.tail()

        User ID  Gender   Age  EstimatedSalary  Purchased
395  15691863.0  Female  46.0          41000.0        1.0
396  15706071.0    Male  51.0          23000.0        1.0
397  15654296.0  Female  50.0          20000.0        1.0
398  15755018.0    Male  36.0          33000.0        0.0
399  15594041.0  Female  49.0          36000.0        1.0

In [5]:
data.shape

(400, 5)

In [6]:
data.describe()

            User ID         Age  EstimatedSalary   Purchased
count  3.730000e+02  370.000000       384.000000  389.000000
mean   1.569248e+07   37.935135     69158.854167    0.354756
std    7.122830e+04   10.510859     34155.202131    0.479055
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562974e+07   30.000000     43000.000000    0.000000
50%    1.569483e+07   37.000000     68500.000000    0.000000
75%    1.575045e+07   46.000000     87000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [7]:
data.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [8]:
data.nunique()

User ID            373
Gender               2
Age                 43
EstimatedSalary    114
Purchased            2
dtype: int64

In [9]:
null_value=data.isnull().sum()
print(null_value)

User ID            27
Gender             36
Age                30
EstimatedSalary    16
Purchased          11
dtype: int64

In [12]:
data.dropna()

        User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510.0    Male  19.0          19000.0        0.0
1    15810944.0    Male  35.0          20000.0        0.0
2    15668575.0  Female  26.0          43000.0        0.0
3    15603246.0  Female  27.0          57000.0        0.0
4    15804002.0    Male  19.0          76000.0        0.0
..          ...     ...   ...              ...        ...
395  15691863.0  Female  46.0          41000.0        1.0
396  15706071.0    Male  51.0          23000.0        1.0
397  15654296.0  Female  50.0          20000.0        1.0
398  15755018.0    Male  36.0          33000.0        0.0
399  15594041.0  Female  49.0          36000.0        1.0

[359 rows x 5 columns]

In [13]:
data.drop(columns='User ID',axis=1,inplace=True)

In [16]:
data['EstimatedSalary'] = data['EstimatedSalary'].fillna(0)

In [18]:
data['Age']=data['Age'].fillna(method='ffill')

In [21]:
data.isnull().sum()

Gender             36
Age                 0
EstimatedSalary     0
Purchased          11
dtype: int64

In [34]:
data['Gender'] = data['Gender'].fillna(data['Gender'].mode()[0])

In [44]:
data['Purchased'] = data['Purchased'].fillna(data['Purchased'].mode()[0])

In [45]:
data.isnull().sum()

Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [46]:
data['Purchased']

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
395    1.0
396    1.0
397    1.0
398    0.0
399    1.0
Name: Purchased, Length: 400, dtype: object